#include <iostream>
using namespace std;

/*
    条款M15:了解异常处理的系统开销
        笔记:
            15.1 如果程序的任何一部分使用了异常，其他部分必须也支持异常。否则在运行时程序就不可能提供正确的异常处理
            15.2 编译器应该允许客户自由控制是否在生成的代码里包含进支持异常的内容。
                a. 如果不包含任何异常(try、throw、catch)，且链接程序库里也没有，可以采用不支持异常处理的方法进行编译
                b. a 能保证异常不会从客户端程序传递进程序库里
                c. a 同时会妨碍客户端程序冲定义程序库中声明的虚拟函数??并且不允许有在客户端定义的回调函数??
            15.3 使用 try 块将造成代码尺寸增加 5%-10% 并且速度同比例减慢
            15.4 使用异常规格同 try 造成同样的系统开销 
*/

int main()
{
    return 0;
}